# 单行注释
# a = 1    # 我是单行注释


# 一定输入法要是英文状态下引号
"""
多
行
注
释

"""

# 注释的代码是不会被运行的,只是起到一个解释说明作用
'''
多
行
注
释

'''

# 取消/注释的快捷键  ctrl + /
# # a1 = 1
# a2 = 2
# a = 4

# 标识符命名规则
# 开发人员在程序中自定义的一些符号和名称。标识符是自己定义的, 如变量名 、函数名等
# 标识符由字母、下划线和数字组成，且数字不能开头

name = 4  # 表示变量name创建 将4保存在了name变量里面 (只有在给变量进行赋值的时候 才表示他创建成功了)
_name = 4
# 1name = 5 # (红色波浪线代表的是报错,黄色波连线是警告不会影响代码的正常)

# python中的标识符是区分大小写的
# 他们是2个独立的
any = 6
ANY = 6

# 我们的代码规范是遵循PEP8(代码的规范 并不会影响代码的运行)

# 警告是不会影响代码运行  只是对书写格式的一个警告
name1 = 1

# 代码格式化也是有一个快捷键  ctrl+alt+l

