"""print()输出"""
# name = '泽言'
# print(name)     # 任何结果需要在运行的时候输出就要使用print函数
#
# # 同时打印多个内容
print(111,23,55)

# ctrl
# sep参数
print(111,666) # 如果sep参数不写的话默认是以空格字符分割
print(111,666,sep='_')
print(111,666,sep='我')
print(666,666,sep='牛')

# # end参数 \n就是每一行的换行符   # 如果end参数不写的话默认是以换行符输出  \n(换行符)
print(111,end='_')
print(222)


# """input输入函数"""
# # 可以让我们自己通过键盘手动去输入内容
#
# # 在我们使用input他返回的是一个str(字符串)的数据类型
# name1 = input('请输入你的名字:')
# print(name1)
#
# # 如果想去看每一个变量他的数据类型 就需要使用type
# print(type(name1))
#
# # 每种数据类型都有自己独特的方法 一定要做一个区别



