"""
面向对象:类与对象
           类  是指一类按照一定的规则划分出来的一个群体
           对象: 类中一个东西

           类   按照灵长类动物来划分  人    ------------> 类
           泽言 在座的各位同学都是属于人这个类别里面的 -------->此时的我们就相当于类的一个一个对象

           在一个类里面:  所有的对象(个体)都是有一定的属性和行为
           泽言    属性   名字 年龄
                   行为:  你自己能够去做什么   吃饭    这些行为方法就是我们自己封装一个一个函数
                   面向对象  1个类里面封装了很多个函数  函数里面的代码逻辑 是我们自己根据具体要求去封装的

        # 思考一个问题    为什么要去是面向对象这种代码形式
        面向对象的形式就是 类里面可以封装无数个函数  这些函数是自己写不同功能 想要去实现哪一个
                  只要通过类去调用就可以  这样方便我们的代码逻辑 和减少代码的重复逻辑

"""